IDEA Connection Link
ConnectionLink.WriteProtocolArchive Method
 Writes archive including calculation protocol to outStream. If the protocol doesn't exist CBFEM analysis is executed and protocol is generated.
 Namespace: IdeaRS.ConnectionLink
 Assembly: IdeaRS.ConnectionLink (in IdeaRS.ConnectionLink.dll) Version: 10.0.1.1 (10.0.1.1)
Syntax
public bool WriteProtocolArchive(
	Stream outStream
)
Public Function WriteProtocolArchive (
	outStream As Stream
) As Boolean
public:
bool WriteProtocolArchive(
	Stream^ outStream
)
Parameters
outStream
Type: System.IO.Stream
Output stream
Return Value
Type: Boolean
True if success
See Also
Reference
ConnectionLink Class
IdeaRS.ConnectionLink Namespace